# General and index.html
title=UniCert
welcome=Bienvenue dans UniCert
introtext=UniCert est une authorit\u00e9 de certification en ligne permettant de cr\u00e9er des certificats personnel pour des applications sp\u00e9cifiques. UniCert est utilis\u00e9 dans le projet <a href="https://www.univote.ch/" target="_blank">UniVote</a>, un syst\u00e8me de vote par internet pour la r\u00e9alisation d'\u00e9lections dans les Hautes Ecoles Suisses.
registrationTitle=Enregistrement
registrationText=Pour l'enregistrement, vous avez besoin de vos donn\u00e9es d'acc\u00e8s \u00e0 l'un des fournisseurs d'identit\u00e9 propos\u00e9s. Ceci permet de vous authentifier.
goRegister=S'enregistrer
instructionTitle=Guide de r\u00e9f\u00e9rence rapide
instructionText=TODO
goInstruction=Afficher le guide de r\u00e9f\u00e9rence rapide
switchAAI=SwitchAAI
google=Google
idp=Authentification via

about=Haute \u00e9cole sp\u00e9cialis\u00e9e bernoise BFH

cookieSupport=Acitver Cookies
cookieSupportText=Veuillez activer cookies pour utiliser UniCert.

browsercheck1=Vous utilisez un navigateur d\u00e9pass\u00e9!
browsercheck2=Nous vous conseillons vivement de mettre \u00e0 jour votre navigateur.
browsercheck3=Veuillez utiliser FF 17+, Chrome 23+, Safari 6+ ou IE 9+
processing=Veuillez patienter
loading=Chargement en cours
close=Fermer

goHelpBox=Support/Aide
helpBoxTitle=Support et aide
helpBoxText=Avez-vous des questions ou des suggestions? Ou UniCert ne fonctionne pas comme il devrait? Alors n'h\u00e9sitez pas et prenez contact avec nous.
helpBoxEmail=Votre adresse e-mail
helpBoxMessage=Votre message
helpBoxMessageAdds=En cas de probl\u00e8me avec le syst\u00e8me, nous vous prions d'indiquer le syst\u00e8me d'exploitation et le navigateur internet que vous utilisez.
helpBoxSubmit=Envoyer
helpBoxWait=Veuillez patienter, le formulaire est envoy\u00e9...
helpBoxSuccess=Votre message a \u00e9t\u00e9 envoy\u00e9. Nous vous contacterons sous peu.
helpBoxError=Une erreur est malheureusement survenue. Veuillez r\u00e9essayer.

#registration.xhtml
registration=Enregistrement
userNotAuthorised=Vous ne vous \u00eates pas encore authentifi\u00e9(e). Veuillez retourner \u00e0 la page d'accueil d'UniCert puis veuillez vous authentifier.
goBack=Retour
genkeysStep1=Authentification
genkeysStep2=G\u00e9n\u00e9ration de la cl\u00e9
genkeysStep3=Confirmation
genkeysStep2Text=Pour vous enregistrer, vous devez premi\u00e8rement g\u00e9n\u00e9rer votre cl\u00e9 personnelle. La cl\u00e9 est une suite al\u00e9atoire de caract\u00e8res g\u00e9n\u00e9r\u00e9e localement dans votre navigateur. Vous devez ensuite prot\u00e9ger cette cl\u00e9 avec un mot de passe, afin qu'elle puisse vous \u00eatre envoy\u00e9e par e-mail.
genkeysSubstep21Text=G\u00e9n\u00e9ration de la cl\u00e9 personnelle
genkeysSubstep22Text=Prot\u00e9ger la cl\u00e9 \u00e0 l'aide d'un mot de passe
genCertSubstep23Text=S\u00e9lectionner les options
genkeysSubstep24Text=Envoyer la cl\u00e9 de vote prot\u00e9g\u00e9e par le mot de passe \u00e0 votre adresse e-mail
genkeysButton=G\u00e9n\u00e9rer la cl\u00e9
yourVotingKeyLabel=Votre cl\u00e9 personnelle
retreiveSecretKey=Envoyer l'e-mail
to=\u00e0
password=Entrer le mot de passe
retypePassword=R\u00e9p\u00e9ter le mot de passe
createCertificateFailed=Le certificat n'a pas pu \u00eatre \u00e9tabli.
sendSecretKeyFailed=L'e-mail contenant votre cl\u00e9 de n'a pas pu \u00eatre envoy\u00e9. Veuillez r\u00e9essayer.

regsuccess=Votre cl\u00e9 de a \u00e9t\u00e9 g\u00e9n\u00e9r\u00e9e avec succ\u00e8s et certifi\u00e9e par UniCert. L'e-mail contenant votre cl\u00e9 de prot\u00e9g\u00e9e par le mot de passe a \u00e9t\u00e9 envoy\u00e9. Vous aurez besoin de cette cl\u00e9 dans l'application pour laquelle elle a \u00e9t\u00e9 g\u00e9n\u00e9r\u00e9e. Veuillez donc la conserver \u00e0 un endroit s\u00fbr.
inspectcert=Le certificat de votre cl\u00e9 a \u00e9t\u00e9 \u00e9mis par UniCert. Si vous le d\u00e9sirez, vous pouvez le consulter et le t\u00e9l\u00e9charger.
savecert=Afficher le certificat
backhome=Retour \u00e0 la page d'accueil

yourCertificate=Le certificat de votre cl\u00e9
certDownload=T\u00e9l\u00e9charger
# Certificate labels -> don't translate
certCanonicalName=Canonical Name
certOrganization=Organization
certOrganizationUnit=Organizational Unit
certIssuer=Issuer
certSerialNumber=Serial Number
certValidFrom=Valid From
certValidUntil=Valid Until
certFpSha1=Fingerprint
certPem=Certificate


pleaseSelect=Veuillez choisir une option
keytype=Type de cl\u00e9s
keysize=Taille des cl\u00e9s
valuep=Nombre premier P
valueq=Nombre premier Q
valueg=G\u00e9n\u00e9rateur G

application=Application
role=R\u00f4le
voterCert=Votant
tallierCert=Compteur
mixerCert=Mixeur

identityFunction=Fonction de traitement de l'identit\u00e9
idFStandardSwitch=Fonction standard pour SwitchAAI
idFAnonymizedSwitch=Fonction d'anonymisation pour SwitchAAI
idFZurichSwitch=Fonction sp\u00e9cial de Zurich pour SwitchAAI

switchConnectionSuccessTitle=Login SwitchAAI r\u00e9ussi
switchConnectionSuccessText=La connexion \u00e0 l'aide de SwitchAAI a r\u00e9ussi. Redirection dans quelques secondes.

error100=Vous n'\u00eates pas authentifi\u00e9. Veuillez retourner \u00e0 la page d'accueil d'UniCert et authentifiez-vous.
error101=Arguments manquants. Pas assez de donn\u00e9es envoy\u00e9es au serveur.
error102=Fournisseur d'identit\u00e9 s\u00e9lectionn\u00e9 inconnu
error111=Erreur du serveur.
error120=Fonction de traitement de l'identit\u00e9 inconnue.
error121=Donn\u00e9es d'identit\u00e9 importantes manquantes. Impossible d'initialiser CommonName.
error122=Probl\u00e8me lors de l'anonymisation.
error123=La fonction de traitement de l'identit\u00e9 choisie n'est pas compatible avec les donn\u00e9es re\u00e7ues du fournisseur d'identit\u00e9.
error124=Donn\u00e9es d'identit\u00e9 importantes manquantes. Impossible d'initialiser UniqueId.
error130=Erreur cryptographique.
error131=Type de cl\u00e9s inconnu.
errorundefined=Veuillez contr\u00f4ler votre connexion internet, puis r\u00e9essayez.

error200=Erreur du serveur.
error211=R\u00f4le inconnu.
error221=Syst\u00e8me cryptographique invalide. La taille minimale n'est pas respect\u00e9e.
error222=Signature invalide.
error223=Preuve invalide.
error224=Valeurs cryptographiques incompatibles.
error230=Erreur g\u00e9n\u00e9rale lors de l'\u00e9mission du certificat.

#sendSecretKey
skMailSuccess=L'e-mail a \u00e9t\u00e9 envoy\u00e9 avec succ\u00e8s.
skMailSubject=Votre cl\u00e9 de vote UniCert
skMailBody=Bonjour\n\nVous vous \u00eates enregistr\u00e9(e) avec succ\u00e8s aupr\u00e8s d'UniCert!\n\nCi-dessous se trouve votre cl\u00e9 de vote prot\u00e9g\u00e9e par votre mot de passe. Vous aurez besoin de cette cl\u00e9 dans l'application pour laquelle est a \u00e9t\u00e9 g\u00e9n\u00e9r\u00e9e. Veuillez conserver soigneusement cet e-mail et retenez bien votre mot de passe.\n\nMeilleures salutations\n\nLe service d'enregistrement d'UniCert

